# Sixth Exercise Session

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [16]:
import pandas as pd
import numpy as np
!pip install recordlinkage
import recordlinkage
from recordlinkage.datasets import load_febrl1, load_febrl2

Requirement already satisfied: recordlinkage in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (0.14)
Requirement already satisfied: joblib in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (from recordlinkage) (1.0.1)
Requirement already satisfied: scipy>=1 in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (from recordlinkage) (1.6.2)
Requirement already satisfied: pandas>=0.23 in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (from recordlinkage) (1.2.4)
Requirement already satisfied: numpy>=1.13.0 in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (from recordlinkage) (1.20.1)
Requirement already satisfied: scikit-learn>=0.19.0 in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (from recordlinkage) (0.24.1)
Requirement already satisfied: jellyfish>=0.5.4 in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (from recordlinkage) (0.8.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (from pandas>=0.23->recordlinkage) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (from pandas>=0.23->recordlinkage) (2021.1)
Requirement already satisfied: six>=1.5 in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas>=0.23->recordlinkage) (1.15.0)
Requirement already satisfied: threadpoolctl>=2.0.0 in /home/alessio/anaconda3/envs/DataQuality/lib/python3.8/site-packages (from scikit-learn>=0.19.0->recordlinkage) (2.1.0)

## Data Integration as Data Union

In the following example we are going to integrate two datasets that have the same schema, i.e. we are performing data union task.

In [9]:
data1 = load_febrl1()
data1.head(10)

,given_name,surname,street_number,address_1,address_2,suburb,postcode,state,date_of_birth,soc_sec_id
rec_id,,,,,,,,,,
rec-223-org,NaN,waller,6,tullaroop street,willaroo,st james,4011,wa,19081209,6988048
rec-122-org,lachlan,berry,69,giblin street,killarney,bittern,4814,qld,19990219,7364009
rec-373-org,deakin,sondergeld,48,goldfinch circuit,kooltuo,canterbury,2776,vic,19600210,2635962
rec-10-dup-0,kayla,harrington,NaN,maltby circuit,coaling,coolaroo,3465,nsw,19150612,9004242
rec-227-org,luke,purdon,23,ramsay place,mirani,garbutt,2260,vic,19831024,8099933
rec-6-dup-0,NaN,trevorrow,16,dumas street,2/98-latchford barracks,mount immaney,2281,wa,19530313,4811642
rec-190-dup-0,darcie,turtur,10,blacket street,eureka,beverly hills,2263,nsw,NaN,2025650
rec-294-org,william,bishop,21,neworra place,apmnt 65,worongary,6225,qld,19490130,9773843
rec-206-dup-0,NaN,lombardi,36,yerralee road,leisure living vlge,carlsruhe,3149,qld,19870919,1613132
rec-344-org,NaN,julius,52,florey drive,north stirling downs,coolaroo,2259,qld,19630521,1797144

In [10]:
data2 = load_febrl2()
data2.head(10)

,given_name,surname,street_number,address_1,address_2,suburb,postcode,state,date_of_birth,soc_sec_id
rec_id,,,,,,,,,,
rec-2778-org,sarah,bruhn,44,forbes street,wintersloe,kellerberrin,4510,vic,19300213,7535316
rec-712-dup-0,jacob,lanyon,5,milne cove,wellwod,beaconsfield upper,2602,vic,19080712,9497788
rec-1321-org,brinley,efthimiou,35,sturdee crescent,tremearne,scarborough,5211,qld,19940319,6814956
rec-3004-org,aleisha,hobson,54,oliver street,inglewood,toowoomba,3175,qld,19290427,5967384
rec-1384-org,ethan,gazzola,49,sheaffe street,bimby vale,port pirie,3088,sa,19631225,3832742
rec-3981-org,alicia,hope,100,mansfield place,sunset,byford,6061,sa,19421201,7934773
rec-916-org,benjamin,kolosche,78,keenan street,wingara,raymond terrace,3212,sa,19450918,5698873
rec-1684-org,petreece,lusted,78,baseby place,NaN,east branxton,6214,sa,19950620,8084076
rec-63-dup-0,olivia,white,55,duffy street,shopping village,mirrabooka,2260,vic,19000106,4996142
rec-3808-org,NaN,maynard,32,yerralee road,NaN,altona meadows,4019,nsw,19150402,5146525

In [12]:
print(data1.shape)
print(data2.shape)

(1000, 10)
(5000, 10)

In [17]:
indexer = recordlinkage.Index()
#indexer.block(left_on='first_name', right_on='given_name')
indexer.block('given_name')
pairs = indexer.index(data1, data2)
len(pairs)

18000

The left_on and right_on parameters let you to link attributes of two different dataset providing their name in the two schemas.

In [18]:
compare_c1 = recordlinkage.Compare()

compare_c1.exact('given_name', 'given_name', label='given_name')
compare_c1.string('surname', 'surname', method='jarowinkler', threshold=0.85, label='surname')
compare_c1.exact('date_of_birth', 'date_of_birth', label='date_of_birth')
compare_c1.exact('suburb', 'suburb', label='suburb')
compare_c1.exact('state', 'state', label='state')
compare_c1.string('address_1', 'address_1', threshold=0.85, label='address_1')

features = compare_c1.compute(pairs, data1, data2)
features.head()

                           given_name  surname  date_of_birth  suburb  state  \
rec_id_1    rec_id_2
rec-122-org rec-242-org             1      0.0              0       0      0
            rec-320-org             1      0.0              0       0      0
            rec-534-dup-2           1      0.0              0       0      0
            rec-482-org             1      0.0              0       0      0
            rec-2718-org            1      0.0              0       0      0

                           address_1
rec_id_1    rec_id_2
rec-122-org rec-242-org          0.0
            rec-320-org          0.0
            rec-534-dup-2        0.0
            rec-482-org          0.0
            rec-2718-org         0.0

In [19]:
features.sum(axis=1).value_counts().sort_index(ascending=False)

3.0       14
2.0     4098
1.0    13888
dtype: int64

## Record Linkage in Data Integration

In [21]:
hospital_accounts = pd.read_csv('./Dataset/hospital_account_info.csv')
hospital_reimbursement = pd.read_csv('./Dataset/hospital_reimbursement.csv')

In [22]:
hospital_accounts.head()

,Account_Num,Facility Name,Address,City,State,ZIP Code,County Name,Phone Number,Hospital Type,Hospital Ownership
0,10605,SAGE MEMORIAL HOSPITAL,STATE ROUTE 264 SOUTH 191,GANADO,AZ,86505,APACHE,(928) 755-4541,Critical Access Hospitals,Voluntary non-profit - Private
1,24250,WOODRIDGE BEHAVIORAL CENTER,600 NORTH 7TH STREET,WEST MEMPHIS,AR,72301,CRITTENDEN,(870) 394-4113,Psychiatric,Proprietary
2,10341,DOUGLAS GARDENS HOSPITAL,5200 NE 2ND AVE,MIAMI,FL,33137,MIAMI-DADE,(305) 751-8626,Acute Care Hospitals,Voluntary non-profit - Private
3,81101,SUNCOAST BEHAVIORAL HEALTH CENTER,4480 51ST ST W,BRADENTON,FL,34210,MANATEE,(941) 792-2222,Psychiatric,Proprietary
4,39835,TREASURE VALLEY HOSPITAL,8800 WEST EMERALD STREET,BOISE,ID,83704,ADA,(208) 373-5000,Acute Care Hospitals,Proprietary

In [24]:
hospital_reimbursement.head()

,Provider_Num,Provider Name,Provider Street Address,Provider City,Provider State,Provider Zip Code,Total Discharges,Average Covered Charges,Average Total Payments,Average Medicare Payments
0,839987,SOUTHEAST ALABAMA MEDICAL CENTER,1108 ROSS CLARK CIRCLE,DOTHAN,AL,36301,118,20855.61,5026.19,4115.52
1,519118,MARSHALL MEDICAL CENTER SOUTH,2505 U S HIGHWAY 431 NORTH,BOAZ,AL,35957,43,13289.09,5413.63,4490.93
2,733073,ELIZA COFFEE MEMORIAL HOSPITAL,205 MARENGO STREET,FLORENCE,AL,35631,73,22261.60,4922.18,4021.79
3,201752,MIZELL MEMORIAL HOSPITAL,702 N MAIN ST,OPP,AL,36467,12,10901.33,5343.50,4284.17
4,678488,ST VINCENT'S EAST,50 MEDICAL PARK EAST DRIVE,BIRMINGHAM,AL,35235,74,28117.95,5947.12,4819.53

This is a classical example of **record linkage inside a data integration process**.

We have two dataset refferring to hospitals: one considering some aspect and the other other aspects, but there is a common part. Hence the difference w.r.t. the former example is that here the schemas are not fully overlapping but ony partially, i.e. they carry different information about the same objects.

We will use Sorted Neighborhood method since it works better.

In [25]:
indexer = recordlinkage.SortedNeighbourhoodIndex(left_on = 'Facility Name', right_on='Provider Name', window=15)

Hence the dataset are sorted using the dataset's attributes we are specifing and then the merge is done inside the windows working as the normal windows approach.

In [27]:
pairs = indexer.index(hospital_accounts, hospital_reimbursement)
print(len(pairs))

38900

Now we have to tell the sistem how the matching should be done, i.e. we have to specify the common attributes saying which atrtibute should be compared with each attribute.

In [30]:
compare_c1 = recordlinkage.Compare()

compare_c1.exact('Facility Name', 'Provider Name', label='Hospital')
compare_c1.string('Address', 'Provider Street Address', method='jarowinkler', threshold=0.85, label='Address')
compare_c1.string('City', 'Provider City', threshold=0.85, label='City')
compare_c1.exact('State', 'Provider State', label='State')
compare_c1.exact('ZIP Code', 'Provider Zip Code', label='ZIP Code')

features = compare_c1.compute(pairs, hospital_accounts, hospital_reimbursement)
features.head()

        Hospital  Address  City  State  ZIP Code
0 717          0      0.0   0.0      0         0
1 516          0      0.0   0.0      0         0
2 132          0      0.0   0.0      0         0
4 2168         0      0.0   0.0      0         0
6 1430         0      0.0   0.0      0         0

In [31]:
features.sum(axis=1).value_counts().sort_index(ascending=False)

5.0     2240
4.0      129
3.0       48
2.0      280
1.0     5442
0.0    30761
dtype: int64

We can notice there is a quite high similarity sice there are a lot of tuples that has all the 5 attributes matching.

In [36]:
matches = features[features.sum(axis=1) > 3]
print(len(matches))
matches

2240

           Hospital  Address  City  State  ZIP Code
14   1777         1      1.0   1.0      1         1
27   1502         1      1.0   1.0      1         1
28   779          1      1.0   1.0      1         1
1293 1115         1      1.0   1.0      1         1
3109 507          1      1.0   1.0      1         1
...             ...      ...   ...    ...       ...
5326 2400         1      1.0   1.0      1         1
5328 65           1      1.0   1.0      1         1
5329 2213         1      1.0   1.0      1         1
5334 988          1      1.0   1.0      1         1
5337 593          1      1.0   1.0      1         1

[2240 rows x 5 columns]

For these 2240 matches we can built an integrated dataset: we can put them together and retrieve the data from the two dataset creating a new richer schema.

**From this record linkage you should perform data fusion to build the integrated schema** and all the operation needed to obtain a good integration.